### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [9]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# Raw data file
file_to_load = "Resources/purchase_data.csv"

# Read purchasing file and store into pandas data frame
purchase_data = pd.read_csv(file_to_load)

purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [66]:
total_players = purchase_data["Purchase ID"].count()
total_players

780

In [67]:
purchase_data_df = pd.DataFrame(purchase_data)

In [14]:
purchase_data_df.describe()

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   92.114103    3.050987
std     225.310896    6.659444   52.775943    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   48.000000    1.980000
50%     389.500000   22.000000   93.000000    3.150000
75%     584.250000   25.000000  139.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

In [30]:
mean_price = purchase_data_df["Price"].mean()
sum_price = purchase_data_df["Price"].sum()
unique_items = purchase_data_df["Item ID"].nunique()
ID_count = purchase_data_df["Purchase ID"].count()
summary_calcs = [mean_price,sum_price,unique_items,ID_count]
summary_calcs_df = pd.DataFrame({"Average Price":mean_price,"Total Revenue":sum_price,"Number of Unique Items":unique_items,"Number of Purchases":ID_count},index=[0])
summary_calcs_df.head()

   Average Price  Total Revenue  Number of Unique Items  Number of Purchases
0       3.050987        2379.77                     183                  780

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [74]:
Gendergroup = purchase_data_df.groupby(["Gender"])
Gendergroup_df2 = pd.DataFrame(Gendergroup.count())
Gendergroup_df2.head()

                       Purchase ID   SN  Age  Item ID  Item Name  Price
Gender
Female                         113  113  113      113        113    113
Male                           652  652  652      652        652    652
Other / Non-Disclosed           15   15   15       15         15     15

In [105]:
Gendergroup_df_copy = Gendergroup_df.copy()
Malepct = Gendergroup_df2.loc["Male", "SN"] / Gendergroup_df2["SN"].sum() * 100
Fmlpct = Gendergroup_df2.loc["Female","SN"] / Gendergroup_df2["SN"].sum() * 100
Othpct = Gendergroup_df2.loc["Other / Non-Disclosed","SN"] / Gendergroup_df2["SN"].sum() *100
Maletot = Gendergroup_df2.loc["Male", "SN"]
Fmltot = Gendergroup_df2.loc["Female", "SN"]
Othtot = Gendergroup_df2.loc["Other / Non-Disclosed", "SN"]

In [106]:
Summary_Gendergroup_df = pd.DataFrame({"Percentage of Players":[Malepct,Fmlpct,Othpct],"Total Players":[Maletot,Femtot,Othtot]},index = ["Male","Female","Other / Non-Disclosed"])
Summary_Gendergroup_df.head()

                       Percentage of Players  Total Players
Male                               83.589744            652
Female                             14.487179            113
Other / Non-Disclosed               1.923077             15

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [107]:
Gendergroup_Sum_df.head()

                         Price
Gender
Female                  361.94
Male                   1967.64
Other / Non-Disclosed    50.19

In [111]:
Gendergroup_sum = Gendergroup["Price"].sum()
Gendergroup_Sum_df = pd.DataFrame(Gendergroup_sum)
Mal_Avg_Rev = Gendergroup_sum.loc["Male"] / Maletot
Fml_Avg_Rev = Gendergroup_sum.loc["Female"] /  Fmltot
Oth_Avg_Rev = Gendergroup_sum.loc["Other / Non-Disclosed"] / Othtot
Mal_Tot_Rev = Gendergroup_sum.loc["Male"]
Fml_Tot_Rev = Gendergroup_sum.loc["Female"]
Oth_Tot_Rev = Gendergroup_sum.loc["Other / Non-Disclosed"]
Revenue_Summary_df = pd.DataFrame({"Purchase Count":[Maletot,Fmltot,Othtot],"Average Purchase Price":[Mal_Avg_Rev,Fml_Avg_Rev,Oth_Avg_Rev],"Total Purchase Value":[Mal_Tot_Rev,Fml_Tot_Rev,Oth_Tot_Rev]},index=["Male","Female","Other / Non-Disclosed"])
Revenue_Summary_df.head()

,Purchase Count,Average Purchase Price,Total Purchase Value
Male,652,3.017853,1967.64
Female,113,3.203009,361.94
Other / Non-Disclosed,15,3.346000,50.19

## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Purchase Total per Person
Gender,,,,
Female,113,$3.20,$361.94,$3.20
Male,652,$3.02,"$1,967.64",$3.02
Other / Non-Disclosed,15,$3.35,$50.19,$3.35

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [6]:
# Establish bins for ages
age_bins = [0, 9.90, 14.90, 19.90, 24.90, 29.90, 34.90, 39.90, 99999]
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

       Percentage of Players  Total Count
<10                     3.99           23
10-14                   4.86           28
15-19                  23.61          136
20-24                  63.37          365
25-29                  17.53          101
30-34                  12.67           73
35-39                   7.12           41
40+                     2.26           13

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Purchase Total per Person
10-14,28,$2.96,$82.78,$2.96
15-19,136,$3.04,$412.89,$3.04
20-24,365,$3.05,"$1,114.06",$3.05
25-29,101,$2.90,$293.00,$2.90
30-34,73,$2.93,$214.00,$2.93
35-39,41,$3.60,$147.67,$3.60
40+,13,$2.94,$38.24,$2.94
<10,23,$3.35,$77.13,$3.35

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80